pet_examples/evaluation/model_comp_corr/gpt3/graphviz/rulact/1_2.gv
digraph G {
  rankdir=LR;
  start_1[shape=circle label=""];
  task_1[shape=rectangle label="Check defect"];
  task_2[shape=rectangle label="Calculate repair cost"];
  task_3[shape=rectangle label="Check hardware"];
  task_4[shape=rectangle label="Repair hardware"];
  task_5[shape=rectangle label="Check software"];
  task_6[shape=rectangle label="Configure software"];
  task_7[shape=rectangle label="Test system functionality"];
  task_8[shape=rectangle label="Execute repair activity"];
  end_1[shape=doublecircle label=""];
  start_1 -> task_1;
  task_1 -> task_2;
  task_2 -> seg_1;
  seg_1[shape=diamond label="X"];
  seg_1 -> task_3;
  seg_1 -> task_5;
  task_3 -> task_4;
  task_4 -> spg_1;
  spg_1[shape=diamond label="AND"];
  spg_1 -> task_7;
  task_5 -> task_6;
  task_6 -> spg_1;
  task_7 -> task_8;
  task_8 -> end_1;
}
